{
  "aboutMe": "Über mich",
  "contact": "Kontakt",
  "skills": "Fähigkeiten",
  "projects": "Projekte",
  "hello": "Hallo",
  "title": "Fullstack-Entwickler",
  "iam": "Ich bin",
  "downloadCV": "Lebenslauf herunterladen",
  "contactInfo": "Kontaktinformationen",
  "aboutParagraph": "Ich bin ein Full Stack Developer aus Kénitra, Marokko. Mit Erfahrung in der Entwicklung innovativer und benutzerfreundlicher Anwendungen. Ich habe erfolgreich verschiedene Projekte entwickelt, die von Verwaltungsanwendungen bis hin zu benutzerzentrierten Plattformen. Mit einem soliden Verständnis der Softwareentwicklung bin ich stets bereit bereit, neue Technologien zu erlernen und meine Fähigkeiten zu erweitern. Meine Leidenschaft für Lösungen zu schaffen, treibt mein Engagement an, technische technischen Herausforderungen.",
  "myContactInfo": "Meine Kontaktinformationen",
  "hearingFromYou": "Ich freue mich darauf, von Ihnen zu hören!",
  "completedProjects": "Abgeschlossene Projekte",
  "sourceCode": "Quellcode",
  "liveDemo": "Live-Demo",
  "moreDetails": "Mehr Details",
  "frontend": "Frontend",
  "backend": "Backend",
  "courtProject": {
    "title": "Management-System",
    "description1": "In meiner früheren Rolle als Praktikant in der IT-Abteilung des",
    "description2": "Berufungsgerichts in Kénitra",
    "description3": ", ich damit beauftragt, eine neue Webanwendung zu entwickeln und einzuführen, die im lokalen Netzwerk des Gerichts bereitgestellt wird, die Personalressourcen und bereitgestellten Bürogeräte von der Regierung verwaltet, um die Effizienz im Arbeitsablauf zu steigern und bei der Entscheidungsfindung zu helfen.",
    "slide1_title": "Anmeldeseite",
    "slide2_title": "Mitarbeiterseite",
    "slide3_title": "Hinzufügen eines Mitarbeiters",
    "slide4_title": "Erfolgreich hinzugefügt",
    "slide5_title": "Mitarbeiterdetails",
    "slide6_title": "Umzugsverlauf",
    "slide7_title": "Geräteseite",
    "slide7_description": "Hier können wir alle Geräte sehen, die sich im Inventar befinden, mit dem verfügbaren Bestand und anderen Details.",
    "slide8_title": "Hinzufügen eines Geräts",
    "slide9_title": "Erfolgreich hinzugefügt",
    "slide10_title": "Gerätedetails",
    "slide10_description": "Das kürzlich hinzugefügte Gerät erscheint in keinem Raum, da wir es noch nicht hinzugefügt haben.",
    "slide11_title": "Arbeitsbereiche Seite",
    "slide12_title": "Arbeitsbereichsdetails",
    "slide12_description": "Lassen Sie uns den Raum der Expertise \"Section d'expertise\" überprüfen. Wir können sehen, dass der neu hinzugefügte Mitarbeiter dort arbeitet und es kein Gerät gibt.",
    "slide13_title": "Ändern des Arbeitsbereichs",
    "slide13_description": "Ändern Sie den Raum, indem Sie das kürzlich hinzugefügte Gerät hinzufügen und den Namen des Raums in etwas wie \"Physiklabor\" ändern.",
    "slide14_title": "Erfolgreich geändert",
    "slide15_title": "Arbeitsbereichsdetails",
    "slide15_description": "Jetzt können wir das Gerät mit seiner Menge im Raum sehen und der Name wurde geändert.",
    "slide16_title": "Gerätedetails",
    "slide16_description": "Wenn wir die Detailsseite des Geräts überprüfen, können wir den verbleibenden Bestand im Inventar und die Arbeitsbereiche sehen, die dieses bestimmte Gerät halten.",
    "slide17_title": "Archivseite",
    "slide18_title": "Löschen des kürzlich hinzugefügten Mitarbeiters",
    "slide19_title": "Löschen des kürzlich hinzugefügten Geräts",
    "slide19_description": "Beim Löschen von Geräten werden alle Bestände im Inventar und in den Arbeitsbereichen zusammen gelöscht.",
    "slide20_title": "Mitarbeiterarchiv",
    "slide21_title": "Verlauf der Umzüge des archivierten Mitarbeiters",
    "slide22_title": "Wiederherstellen eines archivierten Mitarbeiters",
    "slide22_description": "Ein Arbeitsbereich muss ausgewählt werden, wenn der Mitarbeiter wiederhergestellt wird.",
    "slide23_title": "Gerätearchiv",
    "slide24_title": "Wiederherstellen eines archivierten Geräts"
  },

  "thesesPlatformProject": {
    "title": "Platform für die Verwaltung der Diplomarbeiten",
    "description1": "Für mein Abschlussprojekt habe ich eine Full-Stack-Anwendung entwickelt. Eine Plattform, die Projekte des Studienabschlusses von Studenten",
    "description2": "der Ecole Supérieur de Technologie",
    "description3": "mit Benutzerauthentifizierung und Mehrere Berechtigungen System verwaltet, bei der sich der Administrator, die Professoren und die Studenten anmelden und auf wichtige Informationen zugreifen sowie verschiedene Aufgaben ausführen können.",
    "slide1_title": "Startseite",
    "slide2_title": "Anmeldeseite",
    "slide2_description": "Die Anmeldedaten müssen von der Verwaltung abgerufen werden, da der Student/Professor bereits an der Universität angemeldet ist.",
    "slide3_title": "Admin-Dashboard - Statistiken",
    "slide4_title": "Admin-Dashboard - Studenten",
    "slide5_title": "Admin-Dashboard - Professorenkomitee",
    "slide6_title": "Als Student einloggen",
    "slide7_title": "Startseite für Studenten",
    "slide7_description": "Nach dem Einloggen sehen wir, dass der Student sein Projektthema noch nicht ausgewählt hat (Projekte, die von anderen Studenten ausgewählt wurden, werden angezeigt, um die Auswahl desselben Themas zu vermeiden, was zu einer Ablehnung führen könnte).",
    "slide8_title": "Auswahl eines Projekts",
    "slide8_description": "Nachdem der Student sein Projektthema ausgewählt hat, erscheint es auf der Projektseite im Admin-Dashboard.",
    "slide9_title": "Studentenprofil",
    "slide10_title": "Admin-Dashboard - Projekte",
    "slide10_description": "Der Administrator kann die Liste der von jedem Studenten ausgewählten Projekte einsehen. Er hat auch die Möglichkeit, das Projekt zu akzeptieren und somit mit der Planung fortzufahren oder das Projekt abzulehnen.",
    "slide11_title": "Admin-Dashboard - Planung eines Projekts",
    "slide11_description": "Bei der Planung einer Abschlusspräsentation muss der Administrator einen Raum reservieren, die Prüfungskomitees zuweisen und ein bestimmtes Datum und eine bestimmte Uhrzeit sowie den Professor festlegen, der das Projekt betreuen wird. Das System überprüft dann, ob es zu Verwirrungen kommt, und handelt entsprechend.",
    "slide12_title": "Erfolgreich geplant",
    "slide12_description": "Nachdem die Abschlussarbeit erfolgreich geplant wurde, wird sie auf der Abschlussarbeiten-Seite für den Administrator angezeigt, um sie zu bearbeiten oder anzuzeigen. Sie kann nicht gelöscht werden, da das System alle Abschlussarbeiten archiviert. Der Student kann nun das Datum und die Uhrzeit der Präsentation sowie weitere Details einsehen.",
    "slide13_title": "Studentenseite nach der Planung der Abschlussarbeit",
    "slide14_title": "Als Professor oder Komiteemitglied einloggen",
    "slide15_title": "Startseite für Komiteemitglieder/Supervisor-Professoren",
    "slide15_description": "Der Professor kann die Liste der Abschlussarbeiten sehen, die er betreut oder an denen er als Komiteemitglied teilnimmt. Er hat die Möglichkeit, jede einzelne zu bewerten.",
    "slide16_title": "Studentenseite - nach der Bewertung der Abschlussarbeit",
    "slide16_description": "Nachdem die Bewertung durch alle Komiteemitglieder erfolgt ist, wird sie auf der Studentenseite und auf der Detailseite der Abschlussarbeit im Admin-Dashboard angezeigt.",
    "slide17_title": "Admin-Dashboard - Projektinformationen"
  },

  "coursifyProject": {
    "title": "Online-Kursplattform",
    "description": "Coursify ist eine Online-Kursplattform, die für Anfänger entwickelt wurde, um neue Themen zu erkunden. Benutzer können sich einfach für Kurse einschreiben, ihren Fortschritt verfolgen, Quizze absolvieren und wichtige Dokumente herunterladen. Mit einer intuitiven, vollständig responsiven und ansprechenden Benutzeroberfläche macht Coursify das Lernen einfach und für jeden zugänglich.",
    "slide1_title": "Admin-Dashboard - Statistiken",
    "slide1_description": "Da die Plattform live ist und der Benutzerbereich zur Erkundung zugänglich ist, wird hier nur das Admin-Dashboard präsentiert.",
    "slide2_title": "Admin-Dashboard - Kurse",
    "slide3_title": "Admin-Dashboard - Kurs hinzufügen: Informationen",
    "slide4_title": "Admin-Dashboard - Kurs hinzufügen: Abschnitte",
    "slide5_title": "Admin-Dashboard - Kurs hinzufügen: Bewertung",
    "slide6_title": "Admin-Dashboard - Kurs hinzufügen: Quiz",
    "slide7_title": "Admin-Dashboard - Kurs hinzufügen: Bestätigung",
    "slide8_title": "Admin-Dashboard - Einstellungen"
  },

  "otasProject": {
    "title": "Online Travel Approval System",
    "description": "Für Dicastal Morocco Africa wurde ein Online-Reisezustimmungssystem entwickelt, eine administrative Anwendung, die die Verwaltung von Geschäftsreiseanfragen durch mehrere Genehmigungsstufen optimiert (Abteilungsleiter, HR, Finanzleiter, CEO...). Das System unterstützt Währungsberechnungen in MAD und EUR, ermöglicht die Genehmigung, Rücksendung oder Ablehnung auf jeder Ebene und generiert ein PDF-Dokument, das Reisedetails und Ausgaben mit digitalen Signaturen zusammenfasst. Es unterstützt auch andere Arten von Anträgen mit jeweils angepassten Genehmigungsprozessen.",
    "slide1_title": "Anmeldeseite",
    "slide2_title": "Als normaler Benutzer einloggen (Die Authentifizierung erfolgt über das Active Directory des Unternehmens)",
    "slide3_title": "Benutzer-Startseite mit relevanten Statistiken",
    "slide4_title": "Eine neue Missionsanfrage erstellen",
    "slide5_title": "Datenvalidierung",
    "slide6_title": "Als Entwurf gespeichert",
    "slide7_title": "Automatisch wurden zwei Reisekostenvorschüsse für jede Währung beantragt",
    "slide8_title": "Details zum Reisekostenvorschuss in MAD",
    "slide9_title": "Details zum Reisekostenvorschuss in EUR",
    "slide10_title": "Die Missionsanfrage bestätigen",
    "slide11_title": "Vor dem Absenden bestätigen",
    "slide12_title": "Missionsanfrage eingereicht - Warten auf die Genehmigung des Abteilungsleiters",
    "slide13_title": "Automatisch eingereichte Reisekostenvorschüsse warten auf die Genehmigung des Abteilungsleiters",
    "slide14_title": "Als Manager der Abteilung einloggen",
    "slide15_title": "\"Entscheidung über Anfragen\" - Präsentation relevanter Statistiken",
    "slide16_title": "Missionsanfragen, die auf Genehmigung warten",
    "slide17_title": "Missionsdetails",
    "slide18_title": "Ablehnungsdialog für die Mission",
    "slide19_title": "Rückgabedialog für die Mission",
    "slide20_title": "Genehmigungsdialog für die Mission",
    "slide21_title": "Missionsanfrage genehmigt - Warten auf die Genehmigung durch HR & Status aktualisiert",
    "slide22_title": "Missionsanfrage nach Genehmigung durch Finanz- und CEO-Bereich",
    "slide23_title": "Jetzt kann der Antragsteller das PDF-Dokument herunterladen, das die Missionsdetails und -ausgaben mit digitalen Signaturen zusammenfasst",
    "slide24_title": "Reisekostenvorschüsse werden nun zur Zahlung an die Kasse weitergeleitet",
    "slide25_title": "Entscheidung über einen Reisekostenvorschuss als Kassenwart",
    "slide26_title": "Markierung der Mittel als vorbereitet - Bargeld oder Vorsorge (Banküberweisung)",
    "slide27_title": "Reisekostenvorschüsse als vorbereitet markiert - Status für den Benutzer aktualisiert",
    "slide28_title": "Jetzt kann der Benutzer das PDF-Dokument für jeden Reisekostenvorschuss zusammen mit einer Bestätigungsnummer herunterladen",
    "slide29_title": "Der Kassenwart kann den Reisekostenvorschuss nun als zugestellt markieren, indem er die vom Antragsteller bereitgestellte Bestätigungsnummer eingibt",
    "slide30_title": "",
    "slide31_title": "Reisekostenvorschüsse als zugestellt markiert",
    "slide32_title": "Der Statusverlauf wurde aktualisiert",
    "slide33_title": "Nachdem die Mittel eingezogen wurden, muss der Antragsteller einen Liquidationsprozess einleiten (Rückerstattung)",
    "slide34_title": "Auswahl eines Anfragetyps für die Liquidation (in diesem Fall Reisekostenvorschuss)",
    "slide35_title": "Liquidation des Reisekostenvorschusses in EUR",
    "slide36_title": "Als Entwurf gespeichert",
    "slide37_title": "Bearbeiten der Entwurfsliquidationsanfrage",
    "slide38_title": "Bestätigungsphase",
    "slide39_title": "Liquidationsprozess für den Reisekostenvorschuss in EUR wurde eingereicht",
    "slide40_title": "Einleiten eines Liquidationsprozesses für den Reisekostenvorschuss in MAD",
    "slide40_description": "Das System berechnet automatisch den verbleibenden Betrag, der liquidiert werden muss, Defizit oder Überschuss",
    "slide41_title": "Ausstehende Liquidationsanfragen",
    "slide42_title": "Entscheidung über eine Liquidationsanfrage",
    "slide43_title": "Rückgabedialog",
    "slide44_title": "Genehmigungsdialog (Liquidationsanfrage kann nicht abgelehnt werden, da dieser Prozess obligatorisch ist)",
    "slide45_title": "Entscheidung über die andere Liquidationsanfrage",
    "slide47_title": "Der Antragsteller hat weniger als den Reisekostenvorschussbetrag ausgegeben",
    "slide47_description": "Das System berechnet automatisch den Überschuss und den verbleibenden Betrag, der liquidiert werden muss.",
    "slide48_title": "Der Statusverlauf wurde aktualisiert",
    "slide49_title": "CEO hat die Liquidationsanfragen genehmigt - Status aktualisiert",
    "slide50_title": "Jetzt kann der Benutzer das PDF-Dokument herunterladen, das die Liquidationsdetails und -ausgaben mit digitalen Signaturen zusammenfasst",
    "slide51_title": "Das Dokument zeigt die Liquidationsdetails",
    "slide52_title": "Entscheidung über die Liquidation als Kassenwart",
    "slide53_title": "Rückgabedialog - Zurück an den Antragsteller, um fehlende Belege erneut hochzuladen, oder an den Finanzmanager, um die Liquidation erneut zu überprüfen",
    "slide53_description": "Die Liquidationsanfrage kann vom Kassenwart an den Antragsteller zurückgegeben werden, um fehlende Belege erneut hochzuladen, oder an den Finanzmanager, um die Liquidation erneut zu überprüfen.",
    "slide54_title": "Abschließender Liquidationsdialog",
    "slide55_title": "Liquidation abgeschlossen (Letzter Status)"
  }
}
