{
  "aboutMe": "Über mich",
  "contact": "Kontakt",
  "skills": "Fähigkeiten",
  "projects": "Projekte",
  "hello": "Hallo",
  "title": "Fullstack-Entwickler",
  "iam": "Ich bin",
  "downloadCV": "Lebenslauf herunterladen",
  "contactInfo": "Kontaktinformationen",
  "aboutParagraph": "Ich bin ein Full Stack Developer aus Kénitra, Marokko. Mit Erfahrung in der Entwicklung innovativer und benutzerfreundlicher Anwendungen. Ich habe erfolgreich verschiedene Projekte entwickelt, die von Verwaltungsanwendungen bis hin zu benutzerzentrierten Plattformen. Mit einem soliden Verständnis der Softwareentwicklung bin ich stets bereit bereit, neue Technologien zu erlernen und meine Fähigkeiten zu erweitern. Meine Leidenschaft für Lösungen zu schaffen, treibt mein Engagement an, technische technischen Herausforderungen.",
  "myContactInfo": "Meine Kontaktinformationen",
  "hearingFromYou": "Ich freue mich darauf, von Ihnen zu hören!",
  "completedProjects": "Abgeschlossene Projekte",
  "courtProject": {
    "title": "Management-System",
    "description1": "In meiner früheren Rolle als Praktikant in der IT-Abteilung des",
    "description2": "Berufungsgerichts in Kénitra",
    "description3": ", ich damit beauftragt, eine neue Webanwendung zu entwickeln und einzuführen, die im lokalen Netzwerk des Gerichts bereitgestellt wird, die Personalressourcen und bereitgestellten Bürogeräte von der Regierung verwaltet, um die Effizienz im Arbeitsablauf zu steigern und bei der Entscheidungsfindung zu helfen."
  },

  "thesesPlatformProject": {
    "title": "Platform für die Verwaltung der Diplomarbeiten",
    "description1": "Für mein Abschlussprojekt habe ich eine Full-Stack-Anwendung entwickelt. Eine Plattform, die Projekte des Studienabschlusses von Studenten",
    "description2": "der Ecole Supérieur de Technologie",
    "description3": "mit Benutzerauthentifizierung und Mehrere Berechtigungen System verwaltet, bei der sich der Administrator, die Professoren und die Studenten anmelden und auf wichtige Informationen zugreifen sowie verschiedene Aufgaben ausführen können."
  }
}
