{
  "aboutMe": "About me",
  "contact": "Contact",
  "skills": "Skills",
  "projects": "Projects",
  "hello": "Hello",
  "title": "Fullstack Developer",
  "iam": "I am",
  "downloadCV": "Download Resume",
  "contactInfo": "Contact Information",
  "aboutParagraph1": "I guess you're curious to know a bit about me if you’ve made it this far, thanks for checking out my site. I’m just someone who happens to be passionate about building software, especially the kind that keeps you thinking long after you've logged off. While I have a favorite tech stack, I care more about using the right tools to solve the right problems.",
  "aboutParagraph2": "I often spend more time than I’d like to admit trying to understand how things work, from low-level hardware to global systems (and a lot of non-tech stuff too). If you didn’t find any of this boring, you’re probably the kind of person I enjoy working or hanging out with.",
  "myContactInfo": "My Contact Information",
  "hearingFromYou": "I look forward to hearing from you!",
  "completedProjects": "Completed Projects",
  "sourceCode": "Source Code",
  "liveDemo": "Live Demo",
  "moreDetails": "More Details",
  "frontend": "Frontend",
  "backend": "Backend",
  "courtProject": {
    "title": "Management System",
    "description1": "In my previous role as an intern in the IT department of",
    "description2": "the Court of Appeal in Kénitra",
    "description3": ", I was tasked with developing and launching a new web application deployed on the court's local network, managing the human resources and office equipment provided by the government to increase efficiency in workflow and assist in decision making.",
    "slide1_title": "Login Page",
    "slide2_title": "Employees Page",
    "slide3_title": "Adding an Employee",
    "slide4_title": "Successfully Added",
    "slide5_title": "Employee Details",
    "slide6_title": "Relocation History",
    "slide7_title": "Equipment Page",
    "slide7_description": "Here we can see all the equipment that is in the inventory with the available stock and other details.",
    "slide8_title": "Adding an Equipment",
    "slide9_title": "Successfully Added",
    "slide10_title": "Equipment Details",
    "slide10_description": "The recently added equipment doesn't appear in any room as we haven't added it in one yet.",
    "slide11_title": "Workspaces Page",
    "slide12_title": "Workspace details",
    "slide12_description": "Let's check the room of expertise \"Section d'expertise\". We can see that the newly added employee is working there and there is no equipment.",
    "slide13_title": "Modifying the Workspace",
    "slide13_description": "modify the room by adding the recently added equipment and changing the name of the room to something like \"Physics Lab\".",
    "slide14_title": "Successfully Modified",
    "slide15_title": "Workspace Details",
    "slide15_description": "Now we can see the equipment with its quantiry in the room and the name has been changed.",
    "slide16_title": "Equipment Details",
    "slide16_description": "If we check the details page of the equipment, we can see the remaining stock in the inventory and the workspaces that hold that particular equipment.",
    "slide17_title": "Archive page",
    "slide18_title": "Deleting recently added employee",
    "slide19_title": "Deleting recently added equipment",
    "slide19_description": "When deleting equipment, all stocks in the inverntory and in workspaces are deleted together.",
    "slide20_title": "Employees Archive",
    "slide21_title": "History of relocations of archived employee",
    "slide22_title": "Restoring an archived employee",
    "slide22_description": "A worskspace must be selected when the employee is restored.",
    "slide23_title": "Equipment Archive",
    "slide24_title": "Restoring an archived equipment"
  },
  "thesesPlatformProject": {
    "title": "Graduation Projects Management Platform",
    "description1": "For my graduation project, I developed a full-stack application. A platform that manages graduation projects of students of",
    "description2": "Ecole Supérieur de Technologie",
    "description3": "with user authentication and multiple permissions system, where the administrator, professors, and students can log in and access important information as well as perform various tasks.",
    "slide1_title": "Home Page",
    "slide2_title": "Login Page",
    "slide2_description": "The login cridentials must be retrieved from the administration since the student/professor is already signed up in the university.",
    "slide3_title": "Admin Dashboard - Statistics",
    "slide4_title": "Admin Dashboard - Students",
    "slide5_title": "Admin Dashboard - Professors Committee",
    "slide6_title": "Logging in as a Student",
    "slide7_title": "Student Home Page",
    "slide7_description": "After logging in, we can see that the student has not yet chosen their project topic yet (projects chosen by other students are shown to avoid choosing the same topic which could lead to rejection).",
    "slide8_title": "Choosing a Project",
    "slide8_description": "After the student have chosen their project topic, it appears on the projects page in the admin dashboard.",
    "slide9_title": "Student Profile",
    "slide10_title": "Admin Dashboard - Projects",
    "slide10_description": "The administrator can view the list of projects selected by each student. He also has the option of accepting the project and thus proceed with scheduling or rejecting the project.",
    "slide11_title": "Admin Dashboard - Scheduling a Project",
    "slide11_description": "When scheduling a thesis presentation, the admin must reserve a room, assign the exam committees and set a specific date and time as well the professor who will supervise the project. The system then checks if there is a confusion and act accordingly.",
    "slide12_title": "Scheduled Successfully",
    "slide12_description": "After the thesis has been successfully scheduled, it will appear on the theses page for the admin to edit or view. It cannot be deleted as the system archives all theses. The student can now see the date and time of the presentation and other details.",
    "slide13_title": "Student page after thesis was scheduled",
    "slide14_title": "Logging in as a professor or a committee member",
    "slide15_title": "Committee member/Supervisor professor home page",
    "slide15_description": "The professor can see the list of theses that he is supervising or the list of theses that he is a committee member of. Having the option to grade each one of them.",
    "slide16_title": "Student page - after the thesis was graded",
    "slide16_description": "After the grade has been assigned by all of the committee members, it will appear on the student page and on the details page of the thesis in the admin dashboard.",
    "slide17_title": "Admin Dashboard - Project details"
  },
  "coursifyProject": {
    "title": "Online Courses Platform",
    "description": "Coursify is an online course platform designed for beginners to explore new subjects. Users can easily enroll in courses, track their progress, complete quizzes, and download important documents. With an intuitive, fully responsive and engaging interface, Coursify makes learning simple and accessible for everyone.",
    "slide1_title": "Admin Dashboard - Statistics",
    "slide1_description": "Since the platform is live and the user section is accessible for exploration, only the admin dashboard is showcased here.",
    "slide2_title": "Admin Dashboard - Courses",
    "slide3_title": "Admin Dashboard - Adding course: Information",
    "slide4_title": "Admin Dashboard - Adding course: Sections",
    "slide5_title": "Admin Dashboard - Adding course: Evaluation",
    "slide6_title": "Admin Dashboard - Adding course: Quiz",
    "slide7_title": "Admin Dashboard - Adding course: Confirmation",
    "slide8_title": "Admin Dashboard - Settings"
  },
  "otasProject": {
    "title": "Online Travel Approval System",
    "description": "Developed an Online Travel Approval System for Dicastal Morocco Africa, an administrative application that optimizes the management of business travel requests through multiple approval levels (department manager, HR, finance manager, CEO...). The system supports currency calculations in MAD and EUR, allows for approval, return, or rejection at each level, and generates a PDF document summarizing trip details and expenses with digital signatures. It also supports other request types each with tailored approval processes.",
    "slide1_title": "Login Page",
    "slide2_title": "Logging in as a normal user (Authenticating is done through the company's Active Directory)",
    "slide3_title": "User Home Page showing relevant statistics",
    "slide4_title": "Making a new Mission Request",
    "slide5_title": "Data validation",
    "slide6_title": "Saved as a draft",
    "slide7_title": "Two travel advances requests has been made automatically for each currency",
    "slide8_title": "Travel advance in MAD details",
    "slide9_title": "Travel advance in EUR details",
    "slide10_title": "Confirming the mission request",
    "slide11_title": "Confirming before submitting",
    "slide12_title": "Mission request submitted - Waiting for department's manager approval",
    "slide13_title": "Related travel advances submitted automatically and waiting for department's manager approval",
    "slide14_title": "Logging in as the manager of the department",
    "slide15_title": "\"Decide on Requests Section\" - Showcasing relevant statistics",
    "slide16_title": "Missions awaiting approval",
    "slide17_title": "Mission details",
    "slide18_title": "Rejecting the mission dialog",
    "slide19_title": "Returning the mission dialog",
    "slide20_title": "Approving the mission dialog",
    "slide21_title": "Mission approved - Waiting for HR approval & Status updated",
    "slide22_title": "Mission approved by Finance and CEO afterward",
    "slide23_title": "Now the requester can download the PDF document summarizing the mission details and expenses with digital signatures",
    "slide24_title": "Travel advances are now forwarded to Treasury for payment",
    "slide25_title": "Deciding upon a travel advance as a treasurer",
    "slide26_title": "Marking the funds as prepared - Cash or Provision (Bank transfer)",
    "slide27_title": "Travel advances marked as prepared - Status updated for the user",
    "slide28_title": "Now the user can download the PDF document for each travel advance along with a confirmation number",
    "slide29_title": "Treasurer can now mark the travel advance as delivered by entering the confirmation number provided by the requester",
    "slide30_title": "",
    "slide31_title": "Travel advances marked as delivered ",
    "slide32_title": "Status history has been updated",
    "slide33_title": "After funds has been collected, the requester must initiate a liquidation process (refund)",
    "slide34_title": "Choosing a request type for liquidation (Travel advance in this case)",
    "slide35_title": "Liquidating the travel advance in EUR",
    "slide36_title": "Saving it as a draft",
    "slide37_title": "Editing the drafted liquidation request",
    "slide38_title": "Confirmation phase",
    "slide39_title": "Liquidation process for the travel advance in EUR has been submitted",
    "slide40_title": "Initiation a liquidation process for the travel advance in MAD as well",
    "slide40_description": "The system automatically calculates the remaining amount to be liquidated, deficit or surplus.",
    "slide41_title": "Pending liquidation requests",
    "slide42_title": "Deciding upon a liquidation request",
    "slide43_title": "Return dialog",
    "slide44_title": "Approve dialog (liquidation request cannot be rejected as this process is mandatory)",
    "slide45_title": "Deciding upon the other liquidation request",
    "slide47_title": "The requetser has spent less than the travel advance amount",
    "slide47_description": "The system automatically calculates the surplus and the remaining amount to be liquidated.",
    "slide48_title": "Status history has been updated",
    "slide49_title": "CEO has approved the liquidation requests - Status updated",
    "slide50_title": "Now the user can download the PDF document summarizing the liquidation details and expenses with digital signatures",
    "slide51_title": "The document showcasing the liquidation details",
    "slide52_title": "Decidinf upon the liquidation as a treasurer",
    "slide53_title": "Returning the liquidation dialog",
    "slide53_description": "The liquidation request can be returned by the treasurer to the requester to reupload missing receipts or to the finance manager to recheck the liquidation.",
    "slide54_title": "Finalazing the liquidation dialog",
    "slide55_title": "Liquidation finalized (Last status)"
  }
}
