{
  "aboutMe": "À propos",
  "contact": "Contact",
  "skills": "Compétences",
  "projects": "Projets",
  "hello": "Bonjour",
  "title": "Développeur Fullstack",
  "iam": "Je suis",
  "downloadCV": "Télécharger CV",
  "contactInfo": "Coordonnées",
  "aboutParagraph": "Je suis un développeur Full Stack de Kénitra, Maroc. J'ai de l'expérience dans le développement d'applications innovantes et conviviales. J'ai développé avec succès divers projets allant des applications administratives aux plateformes centrées sur l'utilisateur. Avec une solide compréhension du développement de logiciels, je suis toujours prêt à apprendre de nouvelles technologies et à élargir mon ensemble de compétences. Ma passion pour la création de solutions efficaces me pousse à relever les défis techniques.",
  "myContactInfo": "Mes coordonnées",
  "hearingFromYou": "Connectons-nous !",
  "completedProjects": "Projets terminés",
  "sourceCode": "Code source",
  "liveDemo": "Démo en direct",
  "moreDetails": "Plus de détails",
  "frontend": "Frontend",
  "backend": "Backend",
  "courtProject": {
    "title": "Système de gestion",
    "description1": "Dans mon précédent rôle en tant que stagiaire au sein du département informatique de",
    "description2": "la Cour d'Appel de Kénitra",
    "description3": ", j'ai été chargé de développer et de lancer une nouvelle application web déployée sur le réseau local de la cour, gérant les ressources humaines et matériels fournis par le gouvernement pour augmenter l'efficacité du flux de travail et aider à la prise de décision.",
    "slide1_title": "Page de connexion",
    "slide2_title": "Page des employés",
    "slide3_title": "Ajout d'un employé",
    "slide4_title": "Ajout réussi",
    "slide5_title": "Détails de l'employé",
    "slide6_title": "Historique de déplacement",
    "slide7_title": "Page des équipements",
    "slide7_description": "Ici, nous pouvons voir tous les équipements qui sont dans l'inventaire avec le stock disponible et d'autres détails.",
    "slide8_title": "Ajout d'un équipement",
    "slide9_title": "Ajout réussi",
    "slide10_title": "Détails de l'équipement",
    "slide10_description": "L'équipement récemment ajouté n'apparaît dans aucune pièce car nous ne l'avons pas encore ajouté.",
    "slide11_title": "Page des espaces de travail",
    "slide12_title": "Détails de l'espace de travail",
    "slide12_description": "Vérifions la salle d'expertise \"Section d'expertise\". Nous pouvons voir que le nouvel employé ajouté y travaille et qu'il n'y a pas d'équipement.",
    "slide13_title": "Modification de l'espace de travail",
    "slide13_description": "modifier la salle en ajoutant l'équipement récemment ajouté et en changeant le nom de la salle en quelque chose comme \"Laboratoire de physique\".",
    "slide14_title": "Modification réussie",
    "slide15_title": "Détails de l'espace de travail",
    "slide15_description": "Maintenant, nous pouvons voir l'équipement avec sa quantité dans la salle et le nom a été changé.",
    "slide16_title": "Détails de l'équipement",
    "slide16_description": "Si nous vérifions la page de détails de l'équipement, nous pouvons voir le stock restant dans l'inventaire et les espaces de travail qui détiennent cet équipement particulier.",
    "slide17_title": "Page d'archive",
    "slide18_title": "Suppression de l'employé récemment ajouté",
    "slide19_title": "Suppression de l'équipement récemment ajouté",
    "slide19_description": "Lors de la suppression de l'équipement, tous les stocks de l'inventaire et des espaces de travail sont supprimés ensemble.",
    "slide20_title": "Archive des employés",
    "slide21_title": "Historique des déplacements de l'employé archivé",
    "slide22_title": "Restauration d'un employé archivé",
    "slide22_description": "Un espace de travail doit être sélectionné lorsque l'employé est restauré.",
    "slide23_title": "Archive des équipements",
    "slide24_title": "Restauration d'un équipement archivé"
  },
  "thesesPlatformProject": {
    "title": "Plateforme de gestion des projets de fin d'études",
    "description1": "Pour mon projet de fin d'études, j'ai développé une application full-stack. Une plateforme qui gère les projets de fin d'études des étudiants de",
    "description2": "l'Ecole Supérieur de Technologie",
    "description3": "avec une authentification utilisateur et un système de permissions multiples, où l'administrateur, les professeurs et les étudiants peuvent se connecter et accéder à des informations importantes ainsi qu'effectuer diverses tâches.",
    "slide1_title": "Page d'accueil",
    "slide2_title": "Page de connexion",
    "slide2_description": "Les informations de connexion doivent être récupérées auprès de l'administration car l'étudiant/professeur est déjà inscrit à l'université.",
    "slide3_title": "Tableau de bord de l'administrateur - Statistiques",
    "slide4_title": "Tableau de bord de l'administrateur - Étudiants",
    "slide5_title": "Tableau de bord de l'administrateur - jury/professeurs",
    "slide6_title": "Connexion en tant qu'étudiant",
    "slide7_title": "Page d'accueil de l'étudiant",
    "slide7_description": "Après s'être connecté, nous pouvons voir que l'étudiant n'a pas encore choisi son sujet de projet (les projets choisis par d'autres étudiants sont affichés pour éviter de choisir le même sujet, ce qui pourrait entraîner un rejet).",
    "slide8_title": "Choisir un projet",
    "slide8_description": "Après que l'étudiant ait choisi son sujet de projet, il apparaît sur la page des projets dans le tableau de bord de l'administrateur.",
    "slide9_title": "Profil de l'étudiant",
    "slide10_title": "Tableau de bord de l'administrateur - Projets",
    "slide10_description": "L'administrateur peut voir la liste des projets sélectionnés par chaque étudiant. Il a également la possibilité d'accepter le projet et de procéder à la planification ou de le rejeter.",
    "slide11_title": "Tableau de bord de l'administrateur - Planification d'un projet",
    "slide11_description": "Lors de la planification d'une présentation de thèse, l'administrateur doit réserver une salle, attribuer les jurys d'examen et fixer une date et une heure spécifiques ainsi que le professeur qui supervisera le projet. Le système vérifie ensuite s'il y a une confusion et agit en conséquence.",
    "slide12_title": "Planification réussie",
    "slide12_description": "Après que la thèse ait été planifiée avec succès, elle apparaîtra sur la page des thèses pour que l'administrateur puisse la modifier ou la consulter. Elle ne peut pas être supprimée car le système archive toutes les thèses. L'étudiant peut maintenant voir la date et l'heure de la présentation ainsi que d'autres détails.",
    "slide13_title": "Page de l'étudiant après la planification de la thèse",
    "slide14_title": "Connexion en tant que professeur ou membre du jury",
    "slide15_title": "Page d'accueil du membre du jury/professeur superviseur",
    "slide15_description": "Le professeur peut voir la liste des thèses qu'il supervise ou la liste des thèses dont il est membre du jury. Il a la possibilité d'évaluer chacune d'entre elles.",
    "slide16_title": "Page de l'étudiant - après l'évaluation de la thèse",
    "slide16_description": "Après que la note ait été attribuée par tous les membres du jury, elle apparaîtra sur la page de l'étudiant et sur la page de détails de la thèse dans le tableau de bord de l'administrateur.",
    "slide17_title": "Tableau de bord de l'administrateur - Détails du projet"
  },
  "coursifyProject": {
    "title": "Plateforme de cours en ligne",
    "description": "Coursify est une plateforme de cours en ligne conçue pour les débutants afin d'explorer de nouveaux sujets. Les utilisateurs peuvent facilement s'inscrire à des cours, suivre leur progression, passer des quiz et télécharger des documents importants. Avec une interface intuitive, entièrement responsive et attrayante, Coursify rend l'apprentissage simple et accessible pour tous.",
    "slide1_title": "Tableau de bord de l'administrateur - Statistiques",
    "slide2_title": "Tableau de bord de l'administrateur - Cours",
    "slide3_title": "Tableau de bord de l'administrateur - Ajout de cours : Informations",
    "slide4_title": "Tableau de bord de l'administrateur - Ajout de cours : Sections",
    "slide5_title": "Tableau de bord de l'administrateur - Ajout de cours : Évaluation",
    "slide6_title": "Tableau de bord de l'administrateur - Ajout de cours : Quiz",
    "slide7_title": "Tableau de bord de l'administrateur - Ajout de cours : Confirmation",
    "slide8_title": "Tableau de bord de l'administrateur - Paramètres"
  },
  "otasProject": {
    "title": "Système d'approbation de voyage en ligne",
    "description": "Développé un système d'approbation de voyage en ligne pour Dicastal Morocco Africa, une application administrative qui optimise la gestion des demandes de voyage d'affaires à travers plusieurs niveaux d'approbation (responsable de département, RH, responsable financier, PDG...). Le système supporte les calculs de devises en MAD et en EUR, permet l'approbation, le retour ou le rejet à chaque niveau, et génère un document PDF récapitulant les détails et les dépenses du voyage avec des signatures numériques. Il prend également en charge autre types de demandes chacun avec des processus d'approbation adaptés.",
    "slide1_title": "Page de connexion",
    "slide2_title": "Connexion en tant qu'utilisateur normal (l'authentification est effectuée via Active Directory de l'entreprise)",
    "slide3_title": "Page d'accueil de l'utilisateur affichant des statistiques pertinentes",
    "slide4_title": "Faire une nouvelle demande de mission",
    "slide5_title": "Validation des données",
    "slide6_title": "Enregistré en tant que brouillon",
    "slide7_title": "Deux demandes d'avance de voyage ont été automatiquement effectuées pour chaque devise",
    "slide8_title": "Détails de l'avance de voyage en MAD",
    "slide9_title": "Détails de l'avance de voyage en EUR",
    "slide10_title": "Confirmation de la demande de mission",
    "slide11_title": "Confirmation avant soumission",
    "slide12_title": "Demande de mission soumise - En attente de l'approbation du responsable du département",
    "slide13_title": "Avances de voyage associées soumises automatiquement et en attente de l'approbation du responsable du département",
    "slide14_title": "Connexion en tant que responsable du département",
    "slide15_title": "Section \"Décider des demandes\" - Affichage des statistiques pertinentes",
    "slide16_title": "Missions en attente d'approbation",
    "slide17_title": "Détails de la mission",
    "slide18_title": "Rejet de la boîte de dialogue de la mission",
    "slide19_title": "Retour de la boîte de dialogue de la mission",
    "slide20_title": "Approbation de la boîte de dialogue de la mission",
    "slide21_title": "Mission approuvée - En attente de l'approbation des RH et mise à jour du statut",
    "slide22_title": "Mission approuvée par les finances et le PDG par la suite",
    "slide23_title": "Maintenant, le demandeur peut télécharger le document PDF récapitulant les détails de la mission et les dépenses avec des signatures numériques",
    "slide24_title": "Les avances de voyage sont maintenant transmises à la trésorerie pour paiement",
    "slide25_title": "Décision sur une avance de voyage en tant que trésorier",
    "slide26_title": "Marquer les fonds comme préparés - En espèces ou en provision (virement bancaire)",
    "slide27_title": "Avances de voyage marquées comme préparées - Mise à jour du statut pour l'utilisateur",
    "slide28_title": "Maintenant, l'utilisateur peut télécharger le document PDF pour chaque avance de voyage avec un numéro de confirmation",
    "slide29_title": "Le trésorier peut maintenant marquer l'avance de voyage comme livrée en entrant le numéro de confirmation fourni par le demandeur",
    "slide30_title": "",
    "slide31_title": "Avances de voyage marquées comme livrées",
    "slide32_title": "L'historique du statut a été mis à jour",
    "slide33_title": "Une fois les fonds collectés, le demandeur doit initier un processus de liquidation (remboursement)",
    "slide34_title": "Choix d'un type de demande pour la liquidation (avance de voyage dans ce cas)",
    "slide35_title": "Liquidation de l'avance de voyage en EUR",
    "slide36_title": "Enregistrement en tant que brouillon",
    "slide37_title": "Modification de la demande de liquidation enregistrée",
    "slide38_title": "Phase de confirmation",
    "slide39_title": "Processus de liquidation pour l'avance de voyage en EUR soumis",
    "slide40_title": "Initiation d'un processus de liquidation pour l'avance de voyage en MAD également",
    "slide40_description": "le système calcule automatiquement le montant restant à liquider, à débiter ou à créditer",
    "slide41_title": "Demandes de liquidation en attente",
    "slide42_title": "Décision concernant une demande de liquidation",
    "slide43_title": "Boîte de dialogue de retour",
    "slide44_title": "Boîte de dialogue d'approbation (la demande de liquidation ne peut pas être rejetée car ce processus est obligatoire)",
    "slide45_title": "Décision concernant l'autre demande de liquidation",
    "slide47_title": "Le demandeur a dépensé moins que le montant de l'avance de voyage",
    "slide47_description": "le système calcule automatiquement l'excédent et le montant restant à liquider",
    "slide48_title": "L'historique du statut a été mis à jour",
    "slide49_title": "Le PDG a approuvé les demandes de liquidation - Mise à jour du statut",
    "slide50_title": "Maintenant, l'utilisateur peut télécharger le document PDF récapitulant les détails de la liquidation et les dépenses avec des signatures numériques",
    "slide51_title": "Le document présentant les détails de la liquidation",
    "slide52_title": "Décision concernant la liquidation en tant que trésorier",
    "slide53_title": "Retour de la boîte de dialogue de liquidation",
    "slide53_description": "La demande de liquidation peut être renvoyée par le trésorier à l'auteur de la demande pour recharger les reçus manquants ou au responsable financier pour vérifier à nouveau la liquidation.",
    "slide54_title": "Finalisation de la boîte de dialogue de liquidation",
    "slide55_title": "Liquidation finalisée (dernier statut)"
  }
}
